function calculator(credit, months) {
  const percent = 17 / 100;

  const sum =
    (credit * percent) / 12 / (1 - (1 / (1 + percent / 12)) ** (months - 1));
  return sum;
}

console.log(calculator(5200, 12));

//  Формула розрахунку ануїтетного платежу (А) являє собою таке співвідношення: А = К * (П / (1 + П) -М-1), де К - сума кредиту (різниця між ціною в оголошені і першим вкладом який в свою чергу потрібно отримати з елементу повзунка що відображений на макеті), П - процентна ставка (17%), М - кількість місяців. Результат розрахунку відобразити в блоці з підписом "Ежемесячный платёж"

// sum = (credit * percent / 12) / (1 - (1 / (1 + percent / 12)) ** (months-1)), де:

// S — це розмір щомісячного платежу;

// Sp — початкова сума кредиту;

// Y — річний відсоток;

// W — загальна кількість платежів.
